mongodb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-10 sáb 17:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MongoDB - The Complete Guide</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martim Lima" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MongoDB - The Complete Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0285210">Basics &amp; Crud Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="basics">basics</span></span></a>
<ul>
<li><a href="#org6eee4c7">Check databases / Create a Database</a></li>
<li><a href="#org07e95c0">Create a document</a></li>
<li><a href="#org58009fb">Find documents</a></li>
<li><a href="#org1b16433">Update Documents</a></li>
<li><a href="#org1d25b90">Replace Documents</a></li>
<li><a href="#orgdc4b18a">Delete Documents</a></li>
<li><a href="#org11ff5b1">Projections</a></li>
<li><a href="#orgf2d5b26">Working with nested documents</a></li>
<li><a href="#orgd7567d9">Working with arrays</a></li>
<li><a href="#org3068702">Acessing structured data</a></li>
</ul>
</li>
<li><a href="#org4bb38a9">Schemas &amp; Relations - How to Structure Documents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="schemasandrelations">schemasandrelations</span></span></a>
<ul>
<li><a href="#orgd4dba08">Structuring documents</a></li>
<li><a href="#org536bb50">Data Types</a></li>
<li><a href="#org910feb5">Database Stats</a></li>
<li><a href="#orgbc2207f">Check the type of an value</a></li>
<li><a href="#orgf235c92">Insert a document with a number with a default 64 bit value</a></li>
<li><a href="#org3e8c88c">Insert a product with a number with an int32 value instead of 64 bit</a></li>
<li><a href="#orga91b73c">Important data type limits</a></li>
</ul>
</li>
<li><a href="#orgc886758">Exploring the Shell and the Server</a></li>
<li><a href="#org38938a9">Create Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="createOperations">createOperations</span></span></a>
<ul>
<li><a href="#org2d775ac">insert() Methods</a></li>
<li><a href="#org54bc79e">writeConcern</a></li>
<li><a href="#org02a794c">Atomicity</a></li>
<li><a href="#orgfc4c4af">Multi-Document Transactions</a></li>
<li><a href="#orgf917153">Importing Data</a></li>
</ul>
</li>
<li><a href="#org32b9ca8">Read Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="readOperations">readOperations</span></span></a></li>
<li><a href="#org3ec1d49">Update Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="updateOperations">updateOperations</span></span></a></li>
<li><a href="#orgbeb43c5">Delete Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deleteOperations">deleteOperations</span></span></a></li>
<li><a href="#org37000d3">Indexes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="indexes">indexes</span></span></a></li>
<li><a href="#orgd7bf891">GeoSpatial Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="geospatialData">geospatialData</span></span></a></li>
<li><a href="#orgdf99727">Numeric Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="numericData">numericData</span></span></a></li>
<li><a href="#org0629b0d">Aggregation Framework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aggregationFramework">aggregationFramework</span></span></a></li>
<li><a href="#orgea5f2d8">MongoDB &amp; Securtiy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="security">security</span></span></a></li>
<li><a href="#org28b132f">Performance, Fault Tolerancy &amp; Deployment&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performanceFaultTolerancyAndDeployment">performanceFaultTolerancyAndDeployment</span></span></a></li>
<li><a href="#orgfb42acc">Transactions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="transactions">transactions</span></span></a></li>
<li><a href="#org6068030">Introduction to Stitch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="stitch">stitch</span></span></a></li>
<li><a href="#org62d44a4">Useful Resources and Links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="resourcesAndLinks">resourcesAndLinks</span></span></a></li>
</ul>
</div>
</div>
<div class="right">
  <a href="https://github.com/fniessen/org-html-themes/blob/master/demo/example.org" class="fa fa-github"> Edit on GitHub</a>
</div>

<hr />

<div id="outline-container-org0285210" class="outline-2">
<h2 id="org0285210">Basics &amp; Crud Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="basics">basics</span></span></h2>
<div class="outline-text-2" id="text-org0285210">
<p>
An overview of the basics of mongodb and crud operations
</p>
</div>

<div id="outline-container-org6eee4c7" class="outline-3">
<h3 id="org6eee4c7">Check databases / Create a Database</h3>
<div class="outline-text-3" id="text-org6eee4c7">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Show all databases</span>
&gt;  show dbs

<span style="color: #405A61;">// </span><span style="color: #405A61;">Use the specified database</span>
&gt; use dbname
</pre>
</div>
</div>
</div>


<div id="outline-container-org07e95c0" class="outline-3">
<h3 id="org07e95c0">Create a document</h3>
<div class="outline-text-3" id="text-org07e95c0">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Create a Document</span>
&gt; db.dbname.insertOne(
    {name: <span style="color: #2aa198;">"product1"</span>, price: <span style="color: #d33682; font-weight: bold;">12.99</span>}
)

<span style="color: #405A61;">// </span><span style="color: #405A61;">Create a document with an embbeded document</span>
&gt; db.dbname.insertOne(
    {
        key1: <span style="color: #2aa198;">"dummy"</span>,
        key2: <span style="color: #d33682; font-weight: bold;">12.99</span>,
        key3: <span style="color: #2aa198;">"A dummy product"</span>,
        key4: {
            key4subkey1: <span style="color: #2aa198;">"key4subval1"</span>,
            key4subkey1: key4subkey2
            }
    }
)

<span style="color: #405A61;">// </span><span style="color: #405A61;">Create various documents in a collection</span>
&gt; db.dbname.insertMany(
    [
        {
            key1: <span style="color: #2aa198;">"value1"</span>,
            key2: <span style="color: #2aa198;">"value2"</span>,
            key3: <span style="color: #2aa198;">"value3"</span>,
            key4: <span style="color: #2aa198;">"value4"</span>,
        },
        {
            key1: <span style="color: #2aa198;">"value1"</span>,
            key2: <span style="color: #2aa198;">"value2"</span>,
            key3: <span style="color: #2aa198;">"value3"</span>,
            key4: <span style="color: #2aa198;">"value4"</span>,
        }
    ]
)

</pre>
</div>
</div>
</div>

<div id="outline-container-org58009fb" class="outline-3">
<h3 id="org58009fb">Find documents</h3>
<div class="outline-text-3" id="text-org58009fb">
<p>
find() doesn&rsquo;t return an array of all the documents in a collection, but a cursor pretty() can only be applied when the result of the operation applied returns a cursor while find() returns a cursor, findOne() returns a document, so it can only be applied to find().
</p>


<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection</span>
&gt; db.dbname.find()

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection in a prettified form</span>
&gt; db.dbname.find().pretty()

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection and convert it to array (This operation returns every document in a collection, despite the size)</span>
&gt; db.dbname.find().toArray()

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection and apply certain operations on each one</span>
&gt; db.dbname.find().forEach((colData) =&gt; {printjson(colData)})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection that match a specific key/value</span>
&gt; db.dbname.find({key: value})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection that are greater than the specificied key/value</span>
&gt; db.dbname.find({key: {$gt: value}})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find one document in a collection that match a specific key/value</span>
&gt; db.dbname.findOne({key: value})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Find all documents in a collection that is greater than the specific key/value</span>
&gt; db.dbname.findOne({key: {$gt: value}})
</pre>
</div>
</div>
</div>


<div id="outline-container-org1b16433" class="outline-3">
<h3 id="org1b16433">Update Documents</h3>
<div class="outline-text-3" id="text-org1b16433">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Update one document</span>
&gt; db.dbname.updateOne({key: <span style="color: #2aa198;">"value"</span>}, {$set: {key: <span style="color: #2aa198;">"updtValue"</span>}})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Update many documents</span>
&gt; db.dbname.updateMany({}, {$set: {key: <span style="color: #2aa198;">"updtValue"</span>}})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Update a document replacing all key/value pairs</span>
&gt; db.dbname.update({key: <span style="color: #2aa198;">"value"</span>}, {{key: <span style="color: #2aa198;">"updtValue"</span>}})i
</pre>
</div>
</div>
</div>


<div id="outline-container-org1d25b90" class="outline-3">
<h3 id="org1d25b90">Replace Documents</h3>
<div class="outline-text-3" id="text-org1d25b90">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Replace a document</span>
&gt; db.dbname.replaceOne(  {
    key1: <span style="color: #2aa198;">"value1"</span>,
    key2: <span style="color: #2aa198;">"value2"</span>,
    key3: <span style="color: #2aa198;">"value3"</span>,
    key4: <span style="color: #2aa198;">"value4"</span>,
  })
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdc4b18a" class="outline-3">
<h3 id="orgdc4b18a">Delete Documents</h3>
<div class="outline-text-3" id="text-orgdc4b18a">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Delete one document</span>
&gt; db.dbname.deleteOne({key: <span style="color: #2aa198;">"value"</span>})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Delete all documents that have common key/pair values</span>
&gt; db.dbname.deleteMany({commonKey: <span style="color: #2aa198;">"commonValue"</span>})

<span style="color: #405A61;">// </span><span style="color: #405A61;">Delete many documents</span>
&gt; db.dbname.deleteMany({})
</pre>
</div>
</div>
</div>
