mongodb.org
** Projections

#+BEGIN_SRC
// Using projections to return all the documents with the choosen properties
> db.dbname.find({}, {key: value}).pretty()

// Using projections to return all the documents in the collection with the choosen properties, excluding some
> db.dbname.find({}, {key: value, _key: value}).pretty()
#+END_SRC


** Working with nested documents

#+BEGIN_SRC
// Update a document with a nested document
> db.dbname.updateMany({}, {$set: {key: {nestedKey1: "nestedValue1", nestedKey2: "nestedValue2"}}})

// Update a document with a nested document
> db.dbname.updateMany({}, {$set: {key: {nKey1: "nVal1", nKey2: "nVal2", nK3: {nk3a: "nk3aVal"}}}})
#+END_SRC


** Working with arrays

#+BEGIN_SRC
> db.dbname.updateOne({key: "val"}, {$set: {newKey: ["val1", "val2"]}})
#+END_SRC


** Acessing structured data

#+BEGIN_SRC
// Acessing a specific field of a document
 > db.dbname.findOne({key: "val"}).key2

// Searching for documents with a specific field
 > db.dbname.find({key: "value"}).pretty()

// Searching for documents that have a field with a specific subfield and value present
 > db.dbname.find({"key.subkey": "subkeyVal"}).pretty()

// Searching for documents that have a field that has a subfield with a specific subfield and value present
 > db.dbname.find({"key.subkey.subsubkey": "subsubkeyVal"}).pretty()
#+END_SRC


-----

* Schemas & Relations - How to Structure Documents :schemasandrelations:
  :PROPERTIES:
  :CATEGORY: Schemas & Relations
  :END:

** Structuring documents

#+BEGIN_SRC javascript
 > db.colname.insertMany([
  {
    name: "Dummy1",
    price: 12.99,
    details: null
  },
  {
    name: "Dummy1",
    price: 1234,
    details: null
  },
  {
    name: "Dummy3",
    price: 29.99,
    details: {name: "nestedDummy"}
  }
])
#+END_SRC

** Data Types

#+BEGIN_SRC javascript
> db.colname.insertOne(
    {
      name: "Dummy Corp Inc",
      isStartup: true,
      employees: 35,
      funding: 01234567899876543210,
      details: {ceo: "Dummy CEO"},
      tags: [{title: "test1"}, {title: "teste2"}],
      foundingDate: new Date(),
      insertedAt: new Timestamp()
    }
)
#+END_SRC

** Database Stats

#+BEGIN_SRC javascript
> db.stats()
#+END_SRC

** Check the type of an value

#+BEGIN_SRC javascript
> typeof db.colname.findOne().key
#+END_SRC

** Insert a document with a number with a default 64 bit value

#+BEGIN_SRC javascript
> db.colname.insertOne({key: 1})
#+END_SRC

** Insert a product with a number with an int32 value instead of 64 bit

#+BEGIN_SRC javascript
> db.colname.insertOne({key: NumberInt(1)})
#+END_SRC

** Important data type limits

+ *Normal integers (int32)* can hold a maximum value of +-2,147,483,647

+ *Long integers (int64)* can hold a maximum value of +-9,223,372,036,854,775,807

+ *Text* can be as long as you want - the limit is the 16mb restriction for the overall document

It's also important to understand the difference between int32 (NumberInt), int64 (NumberLong) and a normal number as you can enter it in the shell.
The same goes for a normal double and NumberDecimal.

+ *NumberInt* creates a int32 value => NumberInt(55)

+ *NumberLong* creates a int64 value => NumberLong(7489729384792)

If you just use a number (e.g. insertOne({a: 1}), this will get added as a normal double into the database.
The reason for this is that the shell is based on JS which only knows float/ double values and doesn't differ between integers and floats.

+  *NumberDecimal* creates a high-precision double value => NumberDecimal("12.99") => This can be helpful for cases where you need (many) exact decimal places for calculations.

When not working with the shell but a MongoDB driver for your app programming language (e.g. PHP, .NET, Node.js, ...), you can use the driver to create these specific numbers.

* Exploring the Shell and the Server


* Create Operations :createOperations:
 :PROPERTIES:
  :CATEGORY: Understanding create Operations
  :END:

** insert() Methods

#+begin_src javascript

#+end_src


*** unordered inserts

#+BEGIN_SRC javascript
> use contactData

> db.persons.insertOne(
    {
        name: "dummy",
        age: 30,
        hobbies: ["Sports", "Cooking"]
    }
)

> db.persons.insertOne(
    {
        name: "dummy2",
        age: 35,
        hobbies: ["Music", "Cinema"]
    }
)

> db.persons.insertMany(
    [
        {
            name: "dummy4",
            age: 18,
        },
                {
            name: "dummy4",
            age: 39,
        },
    ]
)

> db.persons.insert(
        {
            name: "dummy5",
            age: 18,
        }
)
#+END_SRC

