mongodb.html


<div id="outline-container-org11ff5b1" class="outline-3">
<h3 id="org11ff5b1">Projections</h3>
<div class="outline-text-3" id="text-org11ff5b1">
<pre class="example">
// Using projections to return all the documents with the choosen properties
&gt; db.dbname.find({}, {key: value}).pretty()

// Using projections to return all the documents in the collection with the choosen properties, excluding some
&gt; db.dbname.find({}, {key: value, _key: value}).pretty()
</pre>
</div>
</div>


<div id="outline-container-orgf2d5b26" class="outline-3">
<h3 id="orgf2d5b26">Working with nested documents</h3>
<div class="outline-text-3" id="text-orgf2d5b26">
<pre class="example">
// Update a document with a nested document
&gt; db.dbname.updateMany({}, {$set: {key: {nestedKey1: "nestedValue1", nestedKey2: "nestedValue2"}}})

// Update a document with a nested document
&gt; db.dbname.updateMany({}, {$set: {key: {nKey1: "nVal1", nKey2: "nVal2", nK3: {nk3a: "nk3aVal"}}}})
</pre>
</div>
</div>


<div id="outline-container-orgd7567d9" class="outline-3">
<h3 id="orgd7567d9">Working with arrays</h3>
<div class="outline-text-3" id="text-orgd7567d9">
<pre class="example">
&gt; db.dbname.updateOne({key: "val"}, {$set: {newKey: ["val1", "val2"]}})
</pre>
</div>
</div>


<div id="outline-container-org3068702" class="outline-3">
<h3 id="org3068702">Acessing structured data</h3>
<div class="outline-text-3" id="text-org3068702">
<pre class="example">
// Acessing a specific field of a document
 &gt; db.dbname.findOne({key: "val"}).key2

// Searching for documents with a specific field
 &gt; db.dbname.find({key: "value"}).pretty()

// Searching for documents that have a field with a specific subfield and value present
 &gt; db.dbname.find({"key.subkey": "subkeyVal"}).pretty()

// Searching for documents that have a field that has a subfield with a specific subfield and value present
 &gt; db.dbname.find({"key.subkey.subsubkey": "subsubkeyVal"}).pretty()
</pre>


<hr />
</div>
</div>
</div>

<div id="outline-container-org4bb38a9" class="outline-2">
<h2 id="org4bb38a9">Schemas &amp; Relations - How to Structure Documents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="schemasandrelations">schemasandrelations</span></span></h2>
<div class="outline-text-2" id="text-org4bb38a9">
</div>

<div id="outline-container-orgd4dba08" class="outline-3">
<h3 id="orgd4dba08">Structuring documents</h3>
<div class="outline-text-3" id="text-orgd4dba08">
<div class="org-src-container">
<pre class="src src-javascript"> &gt; db.colname.insertMany([
  {
    name: <span style="color: #2aa198;">"Dummy1"</span>,
    price: <span style="color: #d33682; font-weight: bold;">12.99</span>,
    details: <span style="color: #d33682; font-weight: bold;">null</span>
  },
  {
    name: <span style="color: #2aa198;">"Dummy1"</span>,
    price: <span style="color: #d33682; font-weight: bold;">1234</span>,
    details: <span style="color: #d33682; font-weight: bold;">null</span>
  },
  {
    name: <span style="color: #2aa198;">"Dummy3"</span>,
    price: <span style="color: #d33682; font-weight: bold;">29.99</span>,
    details: {name: <span style="color: #2aa198;">"nestedDummy"</span>}
  }
])
</pre>
</div>
</div>
</div>

<div id="outline-container-org536bb50" class="outline-3">
<h3 id="org536bb50">Data Types</h3>
<div class="outline-text-3" id="text-org536bb50">
<div class="org-src-container">
<pre class="src src-javascript">&gt; db.colname.insertOne(
    {
      name: <span style="color: #2aa198;">"Dummy Corp Inc"</span>,
      isStartup: <span style="color: #d33682; font-weight: bold;">true</span>,
      employees: <span style="color: #d33682; font-weight: bold;">35</span>,
      funding: <span style="color: #d33682; font-weight: bold;">01234567899876543210</span>,
      details: {ceo: <span style="color: #2aa198;">"Dummy CEO"</span>},
      tags: [{title: <span style="color: #2aa198;">"test1"</span>}, {title: <span style="color: #2aa198;">"teste2"</span>}],
      foundingDate: <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Date</span>(),
      insertedAt: <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Timestamp</span>()
    }
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org910feb5" class="outline-3">
<h3 id="org910feb5">Database Stats</h3>
<div class="outline-text-3" id="text-org910feb5">
<div class="org-src-container">
<pre class="src src-javascript">&gt; db.stats()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc2207f" class="outline-3">
<h3 id="orgbc2207f">Check the type of an value</h3>
<div class="outline-text-3" id="text-orgbc2207f">
<div class="org-src-container">
<pre class="src src-javascript">&gt; <span style="color: #859900; font-weight: bold;">typeof</span> db.colname.findOne().key
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf235c92" class="outline-3">
<h3 id="orgf235c92">Insert a document with a number with a default 64 bit value</h3>
<div class="outline-text-3" id="text-orgf235c92">
<div class="org-src-container">
<pre class="src src-javascript">&gt; db.colname.insertOne({key: <span style="color: #d33682; font-weight: bold;">1</span>})
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e8c88c" class="outline-3">
<h3 id="org3e8c88c">Insert a product with a number with an int32 value instead of 64 bit</h3>
<div class="outline-text-3" id="text-org3e8c88c">
<div class="org-src-container">
<pre class="src src-javascript">&gt; db.colname.insertOne({key: NumberInt(<span style="color: #d33682; font-weight: bold;">1</span>)})
</pre>
</div>
</div>
</div>

<div id="outline-container-orga91b73c" class="outline-3">
<h3 id="orga91b73c">Important data type limits</h3>
<div class="outline-text-3" id="text-orga91b73c">
<ul class="org-ul">
<li><b>Normal integers (int32)</b> can hold a maximum value of +-2,147,483,647</li>

<li><b>Long integers (int64)</b> can hold a maximum value of +-9,223,372,036,854,775,807</li>

<li><b>Text</b> can be as long as you want - the limit is the 16mb restriction for the overall document</li>
</ul>

<p>
It&rsquo;s also important to understand the difference between int32 (NumberInt), int64 (NumberLong) and a normal number as you can enter it in the shell.
The same goes for a normal double and NumberDecimal.
</p>

<ul class="org-ul">
<li><b>NumberInt</b> creates a int32 value =&gt; NumberInt(55)</li>

<li><b>NumberLong</b> creates a int64 value =&gt; NumberLong(7489729384792)</li>
</ul>

<p>
If you just use a number (e.g. insertOne({a: 1}), this will get added as a normal double into the database.
The reason for this is that the shell is based on JS which only knows float/ double values and doesn&rsquo;t differ between integers and floats.
</p>

<ul class="org-ul">
<li><b>NumberDecimal</b> creates a high-precision double value =&gt; NumberDecimal(&ldquo;12.99&rdquo;) =&gt; This can be helpful for cases where you need (many) exact decimal places for calculations.</li>
</ul>

<p>
When not working with the shell but a MongoDB driver for your app programming language (e.g. PHP, .NET, Node.js, &#x2026;), you can use the driver to create these specific numbers.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc886758" class="outline-2">
<h2 id="orgc886758">Exploring the Shell and the Server</h2>
</div>


<div id="outline-container-org38938a9" class="outline-2">
<h2 id="org38938a9">Create Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="createOperations">createOperations</span></span></h2>
<div class="outline-text-2" id="text-org38938a9">
</div>

<div id="outline-container-org2d775ac" class="outline-3">
<h3 id="org2d775ac">insert() Methods</h3>
<div class="outline-text-3" id="text-org2d775ac">
<div class="org-src-container">
<pre class="src src-javascript">
</pre>
</div>
</div>


<div id="outline-container-orgd68de57" class="outline-4">
<h4 id="orgd68de57">unordered inserts</h4>
<div class="outline-text-4" id="text-orgd68de57">
<div class="org-src-container">
<pre class="src src-javascript">&gt; use contactData

&gt; db.persons.insertOne(
    {
        name: <span style="color: #2aa198;">"dummy"</span>,
        age: <span style="color: #d33682; font-weight: bold;">30</span>,
        hobbies: [<span style="color: #2aa198;">"Sports"</span>, <span style="color: #2aa198;">"Cooking"</span>]
    }
)

&gt; db.persons.insertOne(
    {
        name: <span style="color: #2aa198;">"dummy2"</span>,
        age: <span style="color: #d33682; font-weight: bold;">35</span>,
        hobbies: [<span style="color: #2aa198;">"Music"</span>, <span style="color: #2aa198;">"Cinema"</span>]
    }
)

&gt; db.persons.insertMany(
    [
        {
            name: <span style="color: #2aa198;">"dummy4"</span>,
            age: <span style="color: #d33682; font-weight: bold;">18</span>,
        },
                {
            name: <span style="color: #2aa198;">"dummy4"</span>,
            age: <span style="color: #d33682; font-weight: bold;">39</span>,
        },
    ]
)

&gt; db.persons.insert(
        {
            name: <span style="color: #2aa198;">"dummy5"</span>,
            age: <span style="color: #d33682; font-weight: bold;">18</span>,
        }
)
</pre>
</div>
</div>
</div>
