mongodb.org
*** ordered inserts

#+BEGIN_SRC javascript
> db.hobbies.insertMany(
    [
        {_id: "sports", name: "Sports"},
        {_id: "cooking", name: "Cooking"},
        {_id: "cars", name: "Cars"},
    ]
)
#+END_SRC

As it is the default behaviour of mongoDB, if we try to insert a value already added before, it will cancel the operation and output an error,
but since mongoDB by defaul treats each operation as standalone, it will insert the first value and cancel the others inserts when it gets to the second element.

#+begin_src javascript
> db.hobbies.insertMany(
    [
        {_id: "astronomy", name: "astronomy"},
        {_id: "cooking", name: "Cooking"},
        {_id: "hiking", name: "Hiking"},
    ]
)
#+end_src

To override this behaviour, we can pass a second argument to insertMany().
This second argument is a document used to configure this operation.
In this case, it will fail the first two values and insert the last two values.

#+begin_src javascript
> db.hobbies.insertMany(
    [
        {_id: "sports", name: "Sports"},
        {_id: "cooking", name: "Cooking"},
        {_id: "astronomy", name: "astronomy"},
        {_id: "hiking", name: "Hiking"},
    ],
    {ordered: false}
)
#+end_src



** writeConcern

Write concern describes the level of acknowledgment requested from MongoDB for write operations to a standalone mongod or to replica sets or to sharded clusters.
In sharded clusters, mongos instances will pass the write concern on to the shards.

Starting in MongoDB 4.4, replica sets and sharded clusters support setting a global default write concern.
Operations which do not specify an explicit write concern inherit the global default write concern settings.

#+BEGIN_SRC javascript
// w can be set to either 1 or 0, for server acknowledgment.
> db.persons.insertOne(
    {
        name: "dummy6",
        age: 38,
    },
    {
        writeConcern: {w: 1}
    }
)

// j can be set to either true or false, to trigger jornaling of the entry
> db.persons.insertOne(
    {
        name: "dummy7",
        age: 38,
    },
    {
        writeConcern: {w: 1, j: true}
    }
)

// wtimeout can be set to the timeout of the write operation
> db.persons.insertOne(
    {
        name: "dummy7",
        age: 38,
    },
    {
        writeConcern: {w: 1, j: true, wtimeout: 2000}
    }
)
#+END_SRC


** Atomicity

In MongoDB, a write operation is atomic on the level of a single document,
even if the operation modifies multiple embedded documents within a single document.

** Multi-Document Transactions

When a single write operation (e.g. db.collection.updateMany()) modifies multiple documents,
the modification of each document is atomic, but the operation as a whole is not atomic.

When performing multi-document write operations, whether through a single write operation or multiple write operations, other operations may interleave.

** Importing Data

in the terminal shell

#+BEGIN_SRC shell
mongoimport tv-shows.json -d movieData -c movies --jsonArray --drop
#+END_SRC


* Read Operations :readOperations:
 :PROPERTIES:
  :CATEGORY: Understanding read Operations
  :END:


* Update Operations :updateOperations:
 :PROPERTIES:
  :CATEGORY: Understanding update Operations
  :END:


* Delete Operations :deleteOperations:
 :PROPERTIES:
  :CATEGORY: Understanding delete Operations
  :END:



* Indexes :indexes:
 :PROPERTIES:
  :CATEGORY: Indexes
  :END:


* GeoSpatial Data :geospatialData:
 :PROPERTIES:
  :CATEGORY: GeoSpatil Data and Operations
  :END:


* Numeric Data :numericData:
 :PROPERTIES:
  :CATEGORY: Numeric Data
  :END:


* Aggregation Framework :aggregationFramework:
 :PROPERTIES:
  :CATEGORY: Aggregation Framework
  :END:




* MongoDB & Securtiy :security:
 :PROPERTIES:
  :CATEGORY: Working with mongoDB
  :END:


* Performance, Fault Tolerancy & Deployment :performanceAndDeployment:
 :PROPERTIES:
  :CATEGORY: Performance, Fault Tolerancy and Deployment
  :END:


* Transactions :transactions:
 :PROPERTIES:
  :CATEGORY: Transactions in MongoDB
  :END:


* Introduction to Stitch :stitch:
 :PROPERTIES:
  :CATEGORY: Introduciton to Stitch
  :END:


* Useful Resources and Links :resourcesAndLinks:
