mongodb.html

<div id="outline-container-org8296257" class="outline-4">
<h4 id="org8296257">ordered inserts</h4>
<div class="outline-text-4" id="text-org8296257">
<div class="org-src-container">
<pre class="src src-javascript">&gt; db.hobbies.insertMany(
    [
        {_id: <span style="color: #2aa198;">"sports"</span>, name: <span style="color: #2aa198;">"Sports"</span>},
        {_id: <span style="color: #2aa198;">"cooking"</span>, name: <span style="color: #2aa198;">"Cooking"</span>},
        {_id: <span style="color: #2aa198;">"cars"</span>, name: <span style="color: #2aa198;">"Cars"</span>},
    ]
)
</pre>
</div>

<p>
As it is the default behaviour of mongoDB, if we try to insert a value already added before, it will cancel the operation and output an error,
but since mongoDB by defaul treats each operation as standalone, it will insert the first value and cancel the others inserts when it gets to the second element.
</p>

<div class="org-src-container">
<pre class="src src-javascript">&gt; db.hobbies.insertMany(
    [
        {_id: <span style="color: #2aa198;">"astronomy"</span>, name: <span style="color: #2aa198;">"astronomy"</span>},
        {_id: <span style="color: #2aa198;">"cooking"</span>, name: <span style="color: #2aa198;">"Cooking"</span>},
        {_id: <span style="color: #2aa198;">"hiking"</span>, name: <span style="color: #2aa198;">"Hiking"</span>},
    ]
)
</pre>
</div>

<p>
To override this behaviour, we can pass a second argument to insertMany().
This second argument is a document used to configure this operation.
In this case, it will fail the first two values and insert the last two values.
</p>

<div class="org-src-container">
<pre class="src src-javascript">&gt; db.hobbies.insertMany(
    [
        {_id: <span style="color: #2aa198;">"sports"</span>, name: <span style="color: #2aa198;">"Sports"</span>},
        {_id: <span style="color: #2aa198;">"cooking"</span>, name: <span style="color: #2aa198;">"Cooking"</span>},
        {_id: <span style="color: #2aa198;">"astronomy"</span>, name: <span style="color: #2aa198;">"astronomy"</span>},
        {_id: <span style="color: #2aa198;">"hiking"</span>, name: <span style="color: #2aa198;">"Hiking"</span>},
    ],
    {ordered: <span style="color: #d33682; font-weight: bold;">false</span>}
)
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org54bc79e" class="outline-3">
<h3 id="org54bc79e">writeConcern</h3>
<div class="outline-text-3" id="text-org54bc79e">
<p>
Write concern describes the level of acknowledgment requested from MongoDB for write operations to a standalone mongod or to replica sets or to sharded clusters.
In sharded clusters, mongos instances will pass the write concern on to the shards.
</p>

<p>
Starting in MongoDB 4.4, replica sets and sharded clusters support setting a global default write concern.
Operations which do not specify an explicit write concern inherit the global default write concern settings.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">w can be set to either 1 or 0, for server acknowledgment.</span>
&gt; db.persons.insertOne(
    {
        name: <span style="color: #2aa198;">"dummy6"</span>,
        age: <span style="color: #d33682; font-weight: bold;">38</span>,
    },
    {
        writeConcern: {w: <span style="color: #d33682; font-weight: bold;">1</span>}
    }
)

<span style="color: #405A61;">// </span><span style="color: #405A61;">j can be set to either true or false, to trigger jornaling of the entry</span>
&gt; db.persons.insertOne(
    {
        name: <span style="color: #2aa198;">"dummy7"</span>,
        age: <span style="color: #d33682; font-weight: bold;">38</span>,
    },
    {
        writeConcern: {w: <span style="color: #d33682; font-weight: bold;">1</span>, j: <span style="color: #d33682; font-weight: bold;">true</span>}
    }
)

<span style="color: #405A61;">// </span><span style="color: #405A61;">wtimeout can be set to the timeout of the write operation</span>
&gt; db.persons.insertOne(
    {
        name: <span style="color: #2aa198;">"dummy7"</span>,
        age: <span style="color: #d33682; font-weight: bold;">38</span>,
    },
    {
        writeConcern: {w: <span style="color: #d33682; font-weight: bold;">1</span>, j: <span style="color: #d33682; font-weight: bold;">true</span>, wtimeout: <span style="color: #d33682; font-weight: bold;">2000</span>}
    }
)
</pre>
</div>
</div>
</div>


<div id="outline-container-org02a794c" class="outline-3">
<h3 id="org02a794c">Atomicity</h3>
<div class="outline-text-3" id="text-org02a794c">
<p>
In MongoDB, a write operation is atomic on the level of a single document,
even if the operation modifies multiple embedded documents within a single document.
</p>
</div>
</div>

<div id="outline-container-orgfc4c4af" class="outline-3">
<h3 id="orgfc4c4af">Multi-Document Transactions</h3>
<div class="outline-text-3" id="text-orgfc4c4af">
<p>
When a single write operation (e.g. db.collection.updateMany()) modifies multiple documents,
the modification of each document is atomic, but the operation as a whole is not atomic.
</p>

<p>
When performing multi-document write operations, whether through a single write operation or multiple write operations, other operations may interleave.
</p>
</div>
</div>

<div id="outline-container-orgf917153" class="outline-3">
<h3 id="orgf917153">Importing Data</h3>
<div class="outline-text-3" id="text-orgf917153">
<p>
in the terminal shell
</p>

<div class="org-src-container">
<pre class="src src-shell">mongoimport tv-shows.json -d movieData -c movies --jsonArray --drop
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org32b9ca8" class="outline-2">
<h2 id="org32b9ca8">Read Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="readOperations">readOperations</span></span></h2>
<div class="outline-text-2" id="text-org32b9ca8">
</div>
</div>


<div id="outline-container-org3ec1d49" class="outline-2">
<h2 id="org3ec1d49">Update Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="updateOperations">updateOperations</span></span></h2>
<div class="outline-text-2" id="text-org3ec1d49">
</div>
</div>


<div id="outline-container-orgbeb43c5" class="outline-2">
<h2 id="orgbeb43c5">Delete Operations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="deleteOperations">deleteOperations</span></span></h2>
<div class="outline-text-2" id="text-orgbeb43c5">
</div>
</div>



<div id="outline-container-org37000d3" class="outline-2">
<h2 id="org37000d3">Indexes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="indexes">indexes</span></span></h2>
<div class="outline-text-2" id="text-org37000d3">
</div>
</div>


<div id="outline-container-orgd7bf891" class="outline-2">
<h2 id="orgd7bf891">GeoSpatial Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="geospatialData">geospatialData</span></span></h2>
<div class="outline-text-2" id="text-orgd7bf891">
</div>
</div>


<div id="outline-container-orgdf99727" class="outline-2">
<h2 id="orgdf99727">Numeric Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="numericData">numericData</span></span></h2>
<div class="outline-text-2" id="text-orgdf99727">
</div>
</div>


<div id="outline-container-org0629b0d" class="outline-2">
<h2 id="org0629b0d">Aggregation Framework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aggregationFramework">aggregationFramework</span></span></h2>
<div class="outline-text-2" id="text-org0629b0d">
</div>
</div>




<div id="outline-container-orgea5f2d8" class="outline-2">
<h2 id="orgea5f2d8">MongoDB &amp; Securtiy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="security">security</span></span></h2>
<div class="outline-text-2" id="text-orgea5f2d8">
</div>
</div>


<div id="outline-container-org28b132f" class="outline-2">
<h2 id="org28b132f">Performance, Fault Tolerancy &amp; Deployment&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performanceFaultTolerancyAndDeployment">performanceFaultTolerancyAndDeployment</span></span></h2>
<div class="outline-text-2" id="text-org28b132f">
</div>
</div>


<div id="outline-container-orgfb42acc" class="outline-2">
<h2 id="orgfb42acc">Transactions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="transactions">transactions</span></span></h2>
<div class="outline-text-2" id="text-orgfb42acc">
</div>
</div>


<div id="outline-container-org6068030" class="outline-2">
<h2 id="org6068030">Introduction to Stitch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="stitch">stitch</span></span></h2>
<div class="outline-text-2" id="text-org6068030">
</div>
</div>


<div id="outline-container-org62d44a4" class="outline-2">
<h2 id="org62d44a4">Useful Resources and Links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="resourcesAndLinks">resourcesAndLinks</span></span></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 10-10-2020</p>
<p class="author">Author: Martim Lima</p>
<p class="date">Created: 2020-10-10 sáb 17:44</p>
</div>
</body>
</html>
